ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
    }
  }

  //if(Prog_Status.Play_Status.Play_Flag EQ 0) //还未进入节目播放状态
  //{
    if(Prog_Status.Play_Status.New_Prog_Flag)//while(1) //寻找下一个可播放的节目
    {
      TRACE();

#if QT_EN
      if(Preview_Mode EQ PREVIEW_PROG)
      {
        Prog_Status.Play_Status.Prog_No = Preview_Prog_No;
        SET_SUM(Prog_Status.Play_Status);
      }
#endif

      if(Prog_Status.Play_Status.Prog_No >= Prog_Num.Num ||\
         Prog_Status.Play_Status.Prog_No >= MAX_PROG_NUM)
      {
        Prog_Status.Play_Status.Prog_No = 0;
        SET_SUM(Prog_Status.Play_Status);
      }

      debug("\r\n-----update new prog %d para-----\r\n", Prog_Status.Play_Status.Prog_No);

      Re = 1;
      Re &=(Prog_Status.Play_Status.Prog_No EQ Prog_Status.Play_Status.Last_Prog_No)?1:0;
      Re &= CHK_HT(Prog_Status.Play_Status);
      Re &= CHK_SUM(Prog_Status.Play_Status);
      Re &= CHK_SUM(Prog_Para);
      Re &= CHK_SUM(Prog_Status.Block_Index);

      //如果上次播放和当次播放的节目是一样的，则不更新节目参数等
      if(Re)//Prog_Status.Play_Status.Play_Flag = 0;
      {
        TRACE();

        debug("same prog, no update");
        for(i = 0; i < MAX_AREA_NUM; i ++)
        {
          Prog_Status.Area_Status[i].Counts = 0;
          SET_SUM(Prog_Status.Area_Status[i]);
        }
            //memset((INT8U *)Prog_Status.Area_Status[i].CS + CS_BYTES, 0, S_OFF(S_Area_Status, Tail) - S_OFF(S_Area_Status, CS) - CS_BYTES);

        Prog_Status.Play_Status.Time = 0;
        Prog_Status.Play_Status.Counts = 0;
        Prog_Status.Play_Status.New_Prog_Flag = 0;
        SET_SUM(Prog_Status.Play_Status);

        //---------------------
        /*
        Prog_No = Prog_Status.Play_Status.Prog_No;
        Prog_Status_Init();//Clr_Prog_Status();换了个新节目，重新设置状态
        Prog_Status.Play_Status.Prog_No = Prog_No;

        INT8U i;

        memset(&Prog_Status, 0, sizeof(Prog_Status));
        SET_HT(Prog_Status);
        for(i = 0; i < MAX_AREA_NUM; i ++)
        {
          SET_HT(Prog_Status.Area_Status[i]);

          Prog_Status.Area_Status[i].Last_File_No = 0x00;
          Prog_Status.Area_Status[i].Last_SCN_No = 0x00;

          SET_SUM(Prog_Status.Area_Status[i]);
        }

        SET_HT(Prog_Status.Play_Status);
        SET_SUM(Prog_Status.Play_Status);

        SET_SUM(Prog_Status.Play_Status);
*/
        //Clr_Show_Data();

        return;
      }
      
      TRACE();

      Prog_Status.Play_Status.Last_Prog_No = 0xFF; //设置为一个不存在的节目号
      //SET_HT(Prog_Status.Play_Status);
      SET_SUM(Prog_Status.Play_Status);

      Len = Read_Prog_Para(Prog_Status.Play_Status.Prog_No, &Prog_Para); //重新更新节目参数
      
      if(Len > 0 && Check_Prog_Play_Time() > 0)
      {
        TRACE();

        Prog_No = Prog_Status.Play_Status.Prog_No;
        Prog_Status_Init();//Clr_Prog_Status();换了个新节目，重新设置状态
        Prog_Status.Play_Status.Prog_No = Prog_No;
        SET_SUM(Prog_Status.Play_Status);

        Len = Read_Prog_Block_Index(Prog_Status.Play_Status.Prog_No);//重新读取节目的存储索引

        if(Len > 0)
        {
          TRACE();

          Clr_All_Show_Data();

          Prog_Status.Play_Status.Last_Prog_No = Prog_No;
          Prog_Status.Play_Status.New_Prog_Flag = 0;
          //SET_HT(Prog_Status.Play_Status);
          SET_SUM(Prog_Status.Play_Status);

          for(i = 0; i < MAX_AREA_NUM; i ++)
          {
            Prog_Status.Area_Status[i].New_File_Flag = NEW_FLAG;
            Prog_Status.Area_Status[i].File_No = 0;
            Prog_Status.Area_Status[i].SCN_No = 0;

            Prog_Status.Area_Status[i].Last_File_No = 0xFF;
            Prog_Status.Area_Status[i].Last_SCN_No = 0xFFFF;
            SET_SUM(Prog_Status.Area_Status[i]);
          }
        }
      }
      else
      {
        TRACE();

        Prog_Status.Play_Status.New_Prog_Flag = NEW_FLAG;
        Prog_Status.Play_Status.Prog_No ++;
        SET_SUM(Prog_Status.Play_Status);

        ASSERT_FAILED();
        if(Len EQ 0)
          debug("read prog para failed");
        else
          debug("prog %d now not play time", Prog_Status.Play_Status.Prog_No);
      }

      //Prog_Status.Play_Status.Prog_No ++; //在没有读到节目参数的情况下，读取下一个节目的参数
      //最多查询次数不超过Screen_Para.Prog_Num和MAX_PROG_NUM次
      //if(Count > Screen_Para.Prog_Num || Count > MAX_PROG_NUM)
        //break;
    }
  //}
}

#if DATA_PREP_EN >0
//检查是否更新预准备数据
void Check_Update_Data_Prep(void)
{
  INT8U Prog_No,File_Flag;
  INT8U File_No, Prog_End_Flag;
  INT16U SNum,Len;
  INT16U Counts,i,j,X,Y,Width,Height;
  

  if(Prog_Status.Play_Status.New_Prog_Flag)
    return;
  
  //准备每个分区的参数和数据
  for(i =0; i < Prog_Para.Area_Num && i < MAX_AREA_NUM; i ++)
  {
      if(Screen_Status.Rcv_Flag EQ FRAME_FLAG) //收到一帧，先处理此帧
          return;

    if(Prog_Status.Area_Status[i].New_File_Flag ||\
       Prog_Status.Area_Status[i].New_SCN_Flag ||\
       Prog_Status.Area_Status[i].New_CStep_Flag)
      return;
    
    //获取下一屏数据
    if(GET_VAR(Prep_Data.Data_Read_Flag[i]) EQ DATA_READ) //需要获取下一屏的参数
    {
      SET_VAR(Prep_Data.Data_Read_Flag[i] , 0);
      SNum = Prog_Status.Area_Status[i].SCN_No + 1; //下一个屏号

      Prog_No = Prog_Status.Play_Status.Prog_No;
      File_No = Prog_Status.Area_Status[i].File_No;
            
      if(SNum >= Prog_Status.File_Para[i].Pic_Para.SNum) //读取下个文件
      {
        SNum = 0;
        File_No ++; 
        if(File_No >= Prog_Para.Area_File_Num[i])
          File_No = 0;

        //重新读取文件参数
        if(GET_VAR(Prep_Data.File_Para_Read_Flag[i]) EQ DATA_READ)
        {
          debug("\r\nprepaid prog %d, area %d,file %d para", Prog_No, i, File_No);
          
          SET_VAR(Prep_Data.File_Para_Read_Flag[i], 0);

          if(GET_VAR(Prep_Data.File_Para_Ok_Flag[i]) != DATA_OK ||\
             GET_VAR(Prep_Data.Para_Prog_No[i]) != Prog_No ||\
             GET_VAR(Prep_Data.Para_File_No[i]) != File_No)
          {
              Len = Read_File_Para(Prog_No, i, File_No, \
                 &Prep_Data.File_Para[i].Pic_Para.Flag, &Prep_Data.File_Para[i], sizeof(Prep_Data.File_Para[i]));

              SET_VAR(Prep_Data.Para_Prog_No[i], Prog_No);
              SET_VAR(Prep_Data.Para_File_No[i] , File_No);
              SET_VAR(Prep_Data.File_Para_Ok_Flag[i], (Len >0)?DATA_OK:DATA_ERR);

              if(Len EQ 0)
                return;

              debug("\r\nprepaid prog %d, area %d, file %d, scn %d data",Prog_No, i, File_No, SNum);

              if(GET_VAR(Prep_Data.Data_Ok_Flag[i]) != DATA_OK ||\
                 GET_VAR(Prep_Data.Data_Prog_No[i]) != Prog_No ||\
                 GET_VAR(Prep_Data.Data_SCN_No[i]) != SNum)
              {
                  Len = Read_Show_Data(i, \
                               File_No, \
                               &Prep_Data.File_Para[i],\
                               SNum,\
                               &Prep_Data.Show_Data,&X,&Y,&Width,&Height);

                  SET_VAR(Prep_Data.Data_Prog_No[i] , Prog_No);
                  SET_VAR(Prep_Data.Data_File_No[i] , File_No);
                  SET_VAR(Prep_Data.Data_SCN_No[i] , SNum);
                  SET_VAR(Prep_Data.Data_X[i] , X);
                  SET_VAR(Prep_Data.Data_Y[i] , Y);
                  SET_VAR(Prep_Data.Data_Width[i] , Width);
                  SET_VAR(Prep_Data.Data_Height[i] , Height);
                  SET_VAR(Prep_Data.Data_Ok_Flag[i] , (Len > 0)?DATA_OK:DATA_ERR);
             }
              return;
          }
        }
      }

      debug("\r\nprepaid prog %d, area %d, file %d, scn %d data",Prog_No, i, File_No, SNum);

      if(GET_VAR(Prep_Data.Data_Ok_Flag[i]) != DATA_OK ||\
         GET_VAR(Prep_Data.Data_Prog_No[i]) != Prog_No ||\
         GET_VAR(Prep_Data.Data_SCN_No[i]) != SNum)
      {
          Len = Read_Show_Data(i, \
                       File_No, \
                       &Prog_Status.File_Para[i],\
                       SNum,\
                       &Prep_Data.Show_Data, &X, &Y, &Width, &Height);

         SET_VAR(Prep_Data.Data_Prog_No[i] , Prog_No);
         SET_VAR(Prep_Data.Data_File_No[i] , File_No);
         SET_VAR(Prep_Data.Data_SCN_No[i] , SNum);
         SET_VAR(Prep_Data.Data_X[i] , X);
         SET_VAR(Prep_Data.Data_Y[i] , Y);
         SET_VAR(Prep_Data.Data_Width[i] , Width);
         SET_VAR(Prep_Data.Data_Height[i] , Height);
         SET_VAR(Prep_Data.Data_Ok_Flag[i] , (Len > 0)?DATA_OK:DATA_ERR);
     }
      
