ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
void Para_Show(void)
{/*
  INT16U Len;
  //INT8U IP[4];
  //INT32U Baud; //串口波特率

 //显示板卡地址和串口波特率

  Len = RT_LED_Print(FONT0, 0x01, 0, 0, 3, "%d-%d", Screen_Para.COM_Para.Addr, Screen_Para.COM_Para.Baud);

#if UDISK_EN  
  memcpy(IP, &Screen_Para.ETH_Para.IP, 4);	//显示IP地址和端口号
  Len = RT_LED_Print(FONT0, 0x01, Len, 0, 3, "%d.%d.%d.%d:%d", IP[3], IP[2], IP[1], IP[0], Screen_Para.ETH_Para.Port);
#endif
  */
}

void Print_Cur_Time(void)
{
  debug("cur time: %2d-%2d-%2d %2d:%2d:%2d", Cur_Time.Time[T_YEAR], Cur_Time.Time[T_MONTH], Cur_Time.Time[T_DATE],\
                                             Cur_Time.Time[T_HOUR], Cur_Time.Time[T_MIN], Cur_Time.Time[T_SEC]);
}

//对屏幕进行测试
void Screen_Test(void)
{
  INT16U i, j;
  S_Point P0,P1;
  INT8U Test_Key_Up_Flag;
 /*
   Screen_Para.Base_Para.Width = 1064; 
   Screen_Para.Base_Para.Height = 64;
   Screen_Para.Base_Para.Color = 0x01;
   Screen_Status.Color_Num = 1;

   Set_RT_Show_Area(0, 0, Screen_Para.Base_Para.Width, Screen_Para.Base_Para.Height);
   P0.X = 0;
   P0.Y = 0;

   P1.X = 0;
   P1.Y = 0;
   
   while(1)
   {

   	 //Set_Area_Point_Data(&Show_Data, 0, 32, 16, 0x01);
	// Set_Area_Point_Data(&Show_Data, 0, 32, 17, 0x02);
	// Set_Area_Point_Data(&Show_Data, 0, 32, 18, 0x03);

   Copy_Filled_Rect(&Show_Data_Bak, 0, &P0, 1064, 64, &Show_Data, &P1, 0);
   }  
   */
 //--------------------
#if RMDK_SIM_EN EQ 0
  //测试按键按下并且当前没有在工厂状态，则进入屏幕自检
  if(!(Chk_Test_Key_Down() && Chk_JP_Status() EQ NORMAL_STATUS))
    return;
#else
#if defined(CARD_A0)
   Screen_Para.Base_Para.Width = 720; 
   Screen_Para.Base_Para.Height = 32;
   Screen_Para.Base_Para.Color = 0x01;
   SET_SUM(Screen_Para);
#elif defined(CARD_A1)
   Screen_Para.Base_Para.Width = 1024; 
   Screen_Para.Base_Para.Height = 64;
   Screen_Para.Base_Para.Color = 0x01;
#elif defined(CARD_B0)
   Screen_Para.Base_Para.Width = 2048; 
   Screen_Para.Base_Para.Height = 64;
   Screen_Para.Base_Para.Color = 0x01;
   SET_SUM(Screen_Para);
#else
#error "RMDK_SIIM card type error"
#endif
#endif

  Test_Key_Up_Flag = 0;
 //设置实时显示区域
  Set_RT_Show_Area(0, 0, Screen_Para.Base_Para.Width, Screen_Para.Base_Para.Height);
 
 //Set_RT_Show_Area(713, 0, 247, 64);//Screen_Para.Base_Para.Width, Screen_Para.Base_Para.Height);
  i = 0;
  //全屏亮灭测试
  RT_Play_Status_Enter(1);
 /*-------------
  while(1)
  {
	 Show_Data.Color_Data[(120 -1 )*2] = 0x55;
	 Show_Data.Color_Data[120 * 2 * 40 + (120 - 2) * 2 + 1] = 0x55;
	 Show_Data.Color_Data[120 * 2 * 41 + (120 - 2) * 2 + 1] = 0xAA;
  	 Show_Data.Color_Data[120 * 2 * 42 + (120 - 1) * 2 + 1] = 0x00;
   	 Show_Data.Color_Data[120 * 2 * 43 + (120 - 1) * 2 + 1] = 0xFF;
  }*/
  //-------------------
  while(1)
  {
	Set_Show_Data();

    for(j = 0; j < 300; j ++)
	{
		Delay_ms(1);

		if(Test_Key_Up_Flag EQ 0)
		  Test_Key_Up_Flag = Chk_Test_Key_Up();

		if(Test_Key_Up_Flag && Chk_Test_Key_Down())
		{
		  Test_Key_Up_Flag = 0;
		  break;
		}
	 }

	if(j != 300)
	  break;

    Clr_Show_Data();

    for(j = 0; j < 300; j ++)
	{
		Delay_ms(1);

		if(Test_Key_Up_Flag EQ 0)
		  Test_Key_Up_Flag = Chk_Test_Key_Up();

		if(Test_Key_Up_Flag && Chk_Test_Key_Down())
		{
		  Test_Key_Up_Flag = 0;
		  break;
		}
	 }

	if(j != 300)
	  break;
   }
   
  //Delay_ms(500);
 i=0;
  //横向线测试
  Clr_Show_Data();

  while(1)
  {
    P0.X = i;
	P0.Y = 0;

	P1.X = i;
	P1.Y = Screen_Para.Base_Para.Height - 1;
    Draw_Line(&Show_Data, 0, &P0, &P1, 0x03);

    for(j = 0; j < 300; j ++)
	{
		Delay_ms(1);

		if(Test_Key_Up_Flag EQ 0)
		  Test_Key_Up_Flag = Chk_Test_Key_Up();

		if(Test_Key_Up_Flag && Chk_Test_Key_Down())
		{
		  Test_Key_Up_Flag = 0;
		  break;
		}
	 }

	if(j != 300)
	  break;

	Draw_Line(&Show_Data, 0, &P0, &P1, 0x00);
	i++;
	if(i >= Screen_Para.Base_Para.Width)
	  i = 0;

   }

  //Delay_ms(500);
  i=0;
  //纵向线测试
  Clr_Show_Data();
  while(1)
  {
    P0.X = 0;
	P0.Y = i;

	P1.X = Screen_Para.Base_Para.Width - 1;
	P1.Y = i;

    Draw_Line(&Show_Data, 0, &P0, &P1, 0x03);

    for(j = 0; j < 300; j ++)
	{
		Delay_ms(1);

		if(Test_Key_Up_Flag EQ 0)
		  Test_Key_Up_Flag = Chk_Test_Key_Up();

		if(Test_Key_Up_Flag && Chk_Test_Key_Down())
		{
		  Test_Key_Up_Flag = 0;
		  break;
		}
	 }

	if(j != 300)
	  break;

	Draw_Line(&Show_Data, 0, &P0, &P1, 0x00);
	i++;
	if(i >= Screen_Para.Base_Para.Height)
	  i = 0;

   }

  Clr_Show_Data();
  
  Restore_Show_Area();
  RT_Play_Status_Exit(); //退出实时显示状态
}

//重新播放所有节目
void Replay_Prog(void)
{
	debug("replay prog");
	
	Clr_Show_Data();
	memset(Show_Data_Bak.Color_Data, 0, sizeof(Show_Data_Bak.Color_Data));
	#if DATA_PREP_EN
	memset(&Prep_Data, 0, sizeof(Prep_Data));
	SET_HT(Prep_Data);
	#endif
	Screen_Status.Replay_Flag = 0; //清除重新播放标志
	SET_SUM(Screen_Status);
	
	//重新开始从第0节目播放
	Prog_Status.Play_Status.Last_Prog_No = 0xFF;
	Prog_Status.Play_Status.Prog_No = 0;
	Prog_Status.Play_Status.New_Prog_Flag = NEW_FLAG;
	SET_SUM(Prog_Status);
	
	Calc_Screen_Color_Num(); //计算屏幕颜色个数
	Build_Scan_Data_Index(); //重新构建数据索引

}

//扫描模式的自检
void Scan_Mode_Test(INT8U Mode)
{
  //INT32U Data = 0x55AA5AA5;
  INT8U i,j,k, m, n, tmp, Max_Cols_Fold;
  //INT8U Direct,ErrFlag = 0;
  //S_Time TempTime,TempTime1;

  if(Screen_Status.Scan_Mode_Test_Flag) //防止重复进入
    return;

  Screen_Status.Scan_Mode_Test_Flag = 1;

  Read_Screen_Para();

  //-----------
  Screen_Para.Base_Para.Width = 64;
  Screen_Para.Base_Para.Height = 32;
  Screen_Para.Scan_Para.Cols_Fold = 0;
  Screen_Para.Scan_Para.Rows_Fold = 0;
  Screen_Para.Scan_Para.Rows = 16;
  Screen_Para.Scan_Para.Direct = 0x02;
  Screen_Para.Base_Para.Color = 0x01;
  SET_SUM(Screen_Para);
  //---------------
  //debug("test!!!");
  //Screen_Test();
  //----------
  Set_RT_Show_Area(0, 0, 32, 16);
  Clr_Show_Data();

  Screen_Status.Time_OC_Flag = OPEN_FLAG;
  //Show_Data.Color_Data[0] = 0x55;
  //Show_Data.Color_Data[128] = 0xA5;
  //Show_Data.Color_Data[255] = 0x5A;
  //Show_Data.Color_Data[17] = 0x55;

  Build_Scan_Data_Index();
 /* 
  while(1)
  {
    RT_Play_Status_Enter(2);
    //LED_Print(FONT0, Screen_Para.Base_Para.Color, &Show_Data, 0, 0, 0, "%d%d%d%d", 1, 2, 3, 4);
    //memset(Show_Data.Color_Data, 0x01, sizeof(Show_Data.Color_Data));
   
    for(n = 0; n < 20; n ++)
	{
	  Delay_ms(100);
	  Screen_Com_Proc();

#if QT_EN
   memcpy(&(w->previewArea->screenPara), &Screen_Para, sizeof(Screen_Para));
   w->previewArea->setFixedSize(Screen_Para.Base_Para.Width, Screen_Para.Base_Para.Height);
   w->previewTimerProc();
#endif
	}
  }
   */
  while(1)
  {
   //if(Mode EQ FAC_TEST && Chk_JP_Status() != SELF_TEST_STATUS) //不是自检状态退出
     //     break;

  for(m = 0; m < 5; m ++)
  {
    if(m EQ 0)
	  Screen_Para.Scan_Para.Rows = 16;  //1/16扫描
	else if(m EQ 1)
	  Screen_Para.Scan_Para.Rows = 8;	//1/8扫描
	else if(m EQ 2)
	  Screen_Para.Scan_Para.Rows = 4;	//1/4扫描
	else if(m EQ 3)
	  Screen_Para.Scan_Para.Rows = 2;	//1/2扫描
	else
	  Screen_Para.Scan_Para.Rows = 1;	//静态扫描

	SET_SUM(Screen_Para);

    for(i = 0; i < 4; i ++)
	{

        Screen_Para.Scan_Para.Direct = i;

		if(i EQ 0x01 || i EQ 0x03) //左下入或者右下入，都不需再测试直行的数据，因为和左上入和右上入直行是一样的。
		  tmp = 0x01;
		else
		  tmp = 0x00;

      for(j = tmp; j <= MAX_ROWS_FOLD; j ++)
	  {
	    Screen_Para.Scan_Para.Rows_Fold = j;

		if(j EQ 0)
		  Max_Cols_Fold = 0;
	    else
		  Max_Cols_Fold = MAX_COLS_FOLD;

		for(k = 0; k <= Max_Cols_Fold; k ++)
	    {
          Screen_Para.Scan_Para.Cols_Fold = k;
		  
		  //5种扫描方式逐步试验


			RT_Play_Status_Enter(1);
            LED_Print(FONT0, Screen_Para.Base_Para.Color, &Show_Data, 0, 0, 0, "%d%d%d%d", m, i, j, k);
		    //memset(Show_Data.Color_Data, 0x55, sizeof(Show_Data.Color_Data));
           	//Delay_sec(100);
			
		    for(n = 0; n < 5; n ++)
			{
			  Delay_ms(100);
			  Screen_Com_Proc();
#if QT_EN
   memcpy(&(w->previewArea->screenPara), &Screen_Para, sizeof(Screen_Para));
   w->previewArea->setFixedSize(Screen_Para.Base_Para.Width, Screen_Para.Base_Para.Height);
   w->previewTimerProc();
#endif
			}
			

		  }
	    }
	   }
	 }

	 //Restore_Show_Area();

  }
}

